{
  "doc-3f936faaad445f6d95c5eb93eb29fee7": {
    "content": "In my life, I have experienced many wonderful opportunities, albeit some challenging ones. But there have also been many experiences that I was shut out from. Some of these I was able to brush off and forget about, but others still bother me to this day. One thing that has always been especially hard for me to deal with is my dating life. Since I have a developmental disability, it seems like that’s the first thing people think of when they see me. I have a wheelchair, can’t walk, can’t speak clearly, and need help being fed and getting dressed. As a result, many people never take the time to get to know me truly. But so, what does that mean for a girl that I have real feelings for? What does that mean to a stranger? That I don’t even get the chance of genuinely meeting and getting to know? Human beings understand the people they encounter by categorizing them into buckets. And every day, there emerge new ways to organize people.\nWe all love being a part of something in that way, but what if that “something” is shaming whole groups of people? What if the “category” you get put into is not the right one? What if you were categorized as a nerd, but you were actually a jock? What if you were labeled as “stupid” even though you had all A’s? What if you were labeled as “disabled,” but you really weren’t? Take me, for instance. My brain is just as high functioning as that of any “normal” person. My sister and my staff will be the first to tell you that I have the highest IQ!\nI may have some physical disabilities, but as soon as anyone hears the words “disabled” or “special,” it’s like they don’t know how to act anymore. I believe that our egos and expectations frequently get in the way of our feelings and love. Both are high when I meet new people because I come from a warm, loving, and inclusive family; they see me for who I truly am and do not categorize me based on my physical limitations. The majority of people categorize “people with disabilities” as one big group even though not a single one of us is identical to another. This makes it seem like we all have the same brain activity and physical disabilities as if we are all the same. We aren’t! This can be particularly frustrating for somebody who may go so far as to consider themselves lucky enough to have full brain function and intelligence. It is unfortunate that it only takes someone to glance at me before they conclude that I can’t comprehend or perceive the world we share together as they do. I think that there is a big misconception about “disabled” people. Well, I don’t know if it is fair to call ignorance and generalization a misconception. To those on the receiving end, it feels like the convenient chiseling away of one’s humanity by somebody who neither understands nor has a propensity for learning about those with different bodies than they. Now when it comes to the dating world, add in a whole extra splash and flavor of challenges, difficulty, awkwardness, and more. I have had a few relationships, but nothing like I wish they could have been. I had one girlfriend with whom I had a real relationship. It was very hard to even start it off in the beginning. When we met, I was still living in a group home, and she was actually working for a different company that empowers people with developmental disabilities. I knew she was skeptical about even giving it a try. Something that really bothered me was that her company was almost teaching her that you could never “be” with someone “like me.” This made me open my eyes up to a lot of other things. Many people generally feel like they could never be with someone with a “disability.” But really, you can be with anyone you want, as long as you feel they are the right person for you. We all breathe the same air, bleed the same blood.\nI’ve always wanted to put my life into writing, and the best way I envisioned this was by putting pen to paper and writing an autobiographical book. I didn’t want the entire book to be based on my opinions alone. So, I intend to include multiple anecdotes based on real-life experiences. The people in my life and the experiences I’ve had with them have meant a lot to me. In order to protect their identities, I have changed the names of some of those people. A book such as this requires honesty and candor. Out of respect for the many special experiences and wonderful times I’ve shared with the beautiful and remarkable women I’ve had the privilege to know, I have made use of a pseudonym: Jennifer.\nSome people think that people with “disabilities” can’t function the same way as they; they have fewer life experiences and limited cognitive function, perhaps. So many people assume that the world looks different from a wheelchair, that we live, love, and laugh less because of our “disabilities.” This is simply not true. Take me, for instance. I can attest to the fact that whatever it is, most people assume I cannot do; I absolutely can. I am a very normal guy, and I think about guys. Not unlike your own, my life has held its fair share of challenges. It has been quite a challenging journey that has required spirit, grit, passion, and resilience every step of the way. Needless to say, there have also been some people in my life who have helped me get where I am today. I know we all wish for and dream of the things we want and the people we aspire to become. I’ve had all of those thoughts in my head for as long as I can remember. I’ve pictured my lifestyle and how I want my life to look many different times, and I am still working on getting there one day. But in the long run, I truly believe having dreams to follow and hopefully be able to achieve those dreams someday is what gets you through life.’ I just wish people could understand more about people with different abilities; that we are all human, with real feelings, and have a purpose in this life just like every other person, even if they are categorized as “disabled.”\nIt is February 12. It’s quite early in the morning but not indecently, and I am up because my alarm clock is going off. I look over, and it’s 8 am already! I start to move around very slowly as though to prepare myself for getting out of bed. I went to sleep around 4 am so I am feeling extra sluggish today. I pause for a moment before I start my day and look around. I have worked so hard for this life that I simply wake up every morning to be where I am today. It is a very empowering feeling indeed.\nAnticipation fills me. I know my good friend is coming to visit today because we talked about it last night. She wants to come over so she can help me get situated before the big snowstorm hits. I hear the wind howling outside as I brush my teeth, and you can just tell it is extra cold this morning, which is ironic because today is a special day for me, and it holds very warm memories. See, it is kind of an anniversary. On February 11, some years ago, I encountered somebody very special when I met some friends during a night out with the guys. And now I can’t help but reminisce. I find myself transported to a different time.\nThat morning all those years ago is so like this morning. I revel in the memories for a few more minutes before I get out of my waterbed. My deliciously heated waterbed, did I mention? I got dressed. I go over to my computer. I’ve been keeping a few notes for myself because I want to write a book someday. When I finish writing my thoughts down on the computer, I look outside to the front window. It is a gentle snowfall. Then I put my head down on the back of the couch with my phone next to me. I started thinking about how special the girl I had met all those years ago was. It feels like it was just yesterday. I met last night. After, my staff had left for the night yesterday. I did some scheduling and paperwork for my staff on my computer. Once I was done with all of my work, I turned on the TV. There was breaking news: the headline was a special report now. The meteorologist had said a very bad storm would be coming in the afternoon today. They recommended everything be closed by 2 pm or sooner. Worried, I had sent out a few texts to my staff and dearest friends. The majority of everyone I had texted responded, saying that the weather channel is usually wrong. Or something along the lines of “doesn’t worry about it, it’s not going to get that bad out.”\nI texted them back, saying, “I know, but I want to be safe.” I’d barely gotten any answers back, so I was feeling very frustrated, and I was still worried about what I was going to do if I got snowed in, all alone. The thing is, if I get snowed in, I cannot eat or drink anything till my staff or somebody is able to shovel their way into my home. A few hours had gone by, and I was still watching TV when I heard my cell phone ring. It was my friend, Jennifer.\nWhen I had finished texting Jennifer, I was honestly a little shocked at her response because she would usually always tell me about her new man, but this time she didn’t. I don’t really like it when she tells me about her new guys because I care about her and would be devastated to see her hurt. I had turned the TV back on, but I couldn’t help but think about Jennifer’s response. She had worked with me only for a few months, but it felt like we had known her a long time. We always had fun when she was working. We would joke around as if we were friends and like there were no problems in the world. But during those months, I had grown to love her. She saw something special in me and helped me be that person. However, after a while, I realized that I needed to give up the idea of us being together because she wanted a man who does the same types of things that she enjoys doing. She likes to go on walks, running, bike riding, and go on the trails through the woods.\nI love to do those activities with her because I love to be outside when it is nice outside, but I have a little problem; my power wheelchair can't do things I wish I could make it do. If I can buy a track wheelchair power, maybe I can do what people without a minor disability do. But I am always looking for the right person to be with, and I would like a person like who I am. It is so hard because I feel girls are looking at the outside of a person and how they look rather than the thing that matters most, personality. So, we turned out to be just good friends. Things didn't work out as I had hoped they would between us. But I had said to myself, thank you, God, for allowing me to have met such a nice person.\nThen my cell phone rang again, this time it was my sister Sara. She wrote, “Hi, my favorite brother.” I said to her, “Hi Boo, what’s up?” She said, “I am watching the news; it’s talking about how bad the snowstorm buffalo is getting. What are you doing? I am worried about you.” I said, “I’m watching it too. But no problem, my friend Jennifer is coming around 9 am tomorrow.” Boo said, “Oh, Jennifer is coming! Is she the one who worked with you before, right? Was she the pretty one with glasses and long light brown hair?” I said, “Yes, she did a while ago; I remember she did quit after a few months because she thought I was a cool guy, and she wanted to be a friend more than to be my staff because it has a lot of rules go by. Boo said, “I’m glad she is coming there to be with you because I like her. What about your staff?” I said, “I did text them, and they didn’t take me seriously about it getting bad outside, but I am so happy because Jennifer is coming .” Boo said, “I know you are, please text me if you need anything.” I said, “I will, thank you. Good night. My favorite sister texted me back saying, “Good night to me.”\nRight after I had said goodnight to Sara, my parents then texted me. \"Hi Todd, we watched the news, and we know you're going to be getting a storm. Please be safe and stay at home. We hope someone is going to be with you at home. We love you.\" They're lucky because they live in Florida; they don't have to deal with the snow anymore. I responded, \"Thank you, luckily I have a friend that will be here in the morning. Love you guys goodnight.\" They said, \"Okay, good, please text us if you need anything, Goodnight.\" It was late, I was planning to take a shower, but I didn't because it was already a little bit after 11. I also knew how cold I would be after the shower because no one was here to help me put a new shirt on. I wanted to have a good night's sleep, so I changed to my pajama bottoms.\nI called my cat to come to bed with me. I yelled “MARTHA” “MARTHA,” after a minute or so, and she came strolling into the bedroom. When we are both laid down in bed together, but she always jumps up to the bed and walks around my head. She will lay down next to my left side so I can pet her when she doesn’t want me rubbing her anymore. Then she is going to play with my foot.\nI lay there in bed pondering my thoughts. I eventually fell asleep; even then, I couldn’t sleep for very long. I was too excited at the thought that Jennifer would be here. She is staying over for a few days, which should be great! I jumped out of bed and bounced all around the floor, and I don’t think I’ve ever seen Martha jump up so quickly before. I think I scared her because when I turned around, her hair was standing straight up. She looked like she was going to pounce on me. I said to her, “It is ok, Martha; I need to find something to say to Jennifer when she gets here, maybe a pickup line.” Martha looked at me funny. I went to my computer room and started to look on the Internet. I searched “pick up lines for girls or how to talk to girls.” I had no luck because when I searched “how to talk to a girl,” it took me to online dating and a horrible website.\nI checked the clock; it was 2:37 am. I thought; Oh damn, I will be tired tomorrow, and Jennifer is coming in about six and a half hours!  I looked over at Martha; she was sitting in the doorway staring at me. I can only assume that she was curious and confused as to why I was up at such an hour. I said to her, \"I need to go to bed because I know I'll be tired tomorrow. \"But I think it's a good idea to take a shower first. I know I won't have time in the morning before Jennifer gets here.  I tried telling her to go back to the bedroom, but as I went to my bathroom Martha, of course, wanted to come into the bathroom with me. For a while now, every time I go to the bathroom, Martha races to the door, trying to beat it before it shuts so that she doesn't have to be alone. It's something I can relate to. So, I just allow her to come in there with me the majority of the time.\nAs I’m in the shower, I peek out and see Martha curled up with the floor mat. She saw me, then she jumped on the side of the bathtub, she was walking back and forward on the side of the bathtub. I turned my head around and looked at her; she gave me a little kiss on the front of my nose. Then I waited for her to jump off of the side of the bathtub. Before I turned the water on because I didn’t want to make her scared, when she jumped off the side of the bathtub, she went to the mat and then waited for me. When I got out of the shower, I started to dry off with my towel. Martha has that look in her eye; she knows it’s her turn next. I told her, “I know,” “I know,” we have the system; she started walking towards me because she likes me to take my bath towel and put it on her back and just rub her. I never quite understood why she likes it so much, but it brings me joy to see her get so happy over something so small in my eyes. I’m very grateful to have her in my life. She sits and waits patiently by the door until I open it. I set my bath towel over the tub, opened the door, and went into my bedroom. I saw what time it was. I said, “oh no” “; it’s 3:40 already!?” I didn’t even bother to put my pajamas back on. I climbed into bed and got cozy. I fell asleep pretty quickly.  \nThen my alarm clock went off, and it was 8 o’clock; I was starting to move around for a little bit. Then I got out of bed. My bed is a heated waterbed, so you can only imagine how hard it is for me to get up, especially when it’s cold outside, and I only got a few hours of sleep. I grabbed some clothes from the drawer and put them on. I went on my computer to see if I had any emails, then I went to the living room window to look outside; it was snowing very lightly. Now I am here, and I am waiting for Jennifer to come. She said that she would be here around 9 o’clock; I looked at the clock. It is 8:21 am, then I said to myself. I needed a 20-minute catnap; I put the blanket over me, I closed my eyes, and I felt Martha walking on me; she laid next to me. She always stayed in the room with me, so I was excited and talking to myself about how today was a special day and how my good friend was coming over here to help me.\nI fell asleep for a little while, then I heard my cell phone ring, and it was my staff, Eric. His text read said, “Hey Todd, I’m sorry to do this to you, but I can’t make it because of the weather.” I text him back, “that is funny because I told everyone about the bad snowstorm, that it is coming, and yet everyone laughed at me, but I have everything in control, thankfully. My friend is coming over soon to help me. What would happen if I didn’t have Jennifer come over before the snowstorm?” He texts me back, “I’m really sorry.” I didn’t want to answer him back; I wanted to watch the news instead. I turned on the news; they were saying that we were going to have three-plus feet of snow in the next two days.\nNow I am starting to worry about the effect of the snowstorm and Jennifer. It is 9:15, and I still have no text from her. So, I turned my fireplace on as well because I still didn’t have a shirt on. I went back to the couch and put my blanket back over me, I called for Martha to come here. A few minutes later she came and laid down next to me. I fell asleep but it was only a few minutes. [1]  Then I woke up because I heard a knock at the door. I don’t know how, but I was at the door already; I looked around and saw it was 9:30 am. I was in the living room, the fireplace was running, and Martha ran into the bedroom. I said to myself, and I was lying on the couch! Now I am in front of the door. Did I crawl when I was sleeping? Anyway, I opened the door, and there was Jennifer with two bags. She said, “Good morning, Todd” “I’m moving in” in a joking voice. She then says, “I am still in my pajamas,” as she’s covered in snow. We both just start laughing. She says, “OH MY, you need a shirt!”\nI just nodded my head as I shivered from the door being open. I always want to say so much, but I usually have to keep it too short. I use something called air writing. I take my hand and arm and spell out words letter for letter. It can be frustrating at times, but I try to stay patient and calm. I then say H I with a big smile on my face. I said, C O M E I N, she walked in my place.  Then I crawled over towards my TV; that’s where my augmentation device is hooked up. My device helps me type out longer things I want to say. I type it in, and then the device will speak out loud for me. It read, “Thank you for coming, please take your coat and shoes off, make yourself at home because I think you are going to be stuck for a few days.” She took her shoes off when she took her coat off; she had a black robe on under her coat. She said, “I hope you don’t mind that I look like a bum, but I didn’t find it necessary to get dressed.” “But I think so too, Todd, and I’m hoping that’s okay with you.” I said to her, “That is fine with me!” Then I saw her hair and noticed a difference. So, I asked her, “Did you change your hair color?” she said, “Oh, I did, and I want to try blonde. I did it a week ago after I came to see you.” I said to her, “I like it; I love blonde.” She said, “I know you do, and that was why I did it.” She made me feel special.\nI kept looking at her because I noticed something else about her was different, but I couldn't get my finger on it. I did stop thinking about it, so I said to her, \"Oh, Guess what.\" She says, \"what?\" \"My staff called off because of the weather.\" She said, \"I thought so, I figured that was going to happen to you, and that was one of the reasons why I wanted to come.\" \"Thank you, and you are the best.\" She said, \"You're welcome, and stop that. I wanted to be here, and I care about you.\" She then gave me a big hug and said, \"okay, let's go get a shirt on you!\" She ran into my room and grabbed a shirt from my closet, and put it on me as fast as she could. She could tell that I was freezing. She asked me, \"Are you thirsty; I will make fresh juice for you. I said, \"yes, please, oh you can take your two bags in my bedroom because upstairs is too cold for you.\"\nShe went into my bedroom, put her bags down, then she took her robe off and put it on my bed.  She has adorable pajamas. I thought it was too sexy for her, but I didn't say anything because I didn't want to make her uncomfortable. So, I left it alone. Then she told me, \"Hey you, come with me into the kitchen\" I hopped up in my wheelchair and then followed her into the kitchen. She sat down, and we began to chat. \"I am glad I came when I did because the roads are starting to get worse, and you can barely see in front of you. You know that I live 10 minutes away from here.\" I asked her, \"How long did it take you to get here? \"She said, \"About 50 minutes, and I know you were worried about me like you usually are. I was pretty shocked you didn't text me.\" I said to her, \"you're right, but I didn't want to text you because I knew you were driving here in this weather.\" She got up and grabbed the fruit from the fridge, and set up the juicer.\nI said, “don’t be worrying about food or water because I have a lot of it. “She said, “Oh, I know my Todd always has food here.” She finished cutting the fruit as we continued to talk, I said. “You know I’ve always liked to look at deals, especially on bulk items. It gives me some comfort knowing I have enough spare food in my pantry if I were to be stuck in my house.” We laughed; I said to Jennifer, “Do you remember when we went food shopping?” She said, “Oh yes, and I thought you were crazy.”  I said to her, “why?” She said, “Because when I first started here, I didn’t really know much about how things would work. When we went to the grocery store for the first time, you bought so much I thought you were going to feed an army!” I laughed. She then said, “But over the time that we had worked together, I really did learn a lot from you. You made me a more joyful person. I thank you for that.” I then said, “Please stop that,” as I patted her on the shoulder. We exchanged smiles.\nSo, Jennifer then made my juice for me. She searched the cabinets for the special cups I needed; I sat there and watched, trying not to laugh. She noticed the smirk on my face and came over to me, and gave me a little nudge on my back. She turned back around, and I pointed up to the cabinet where they were in. She poured the juice in and grabbed my little towel. She said, \"oh my gosh! It's been a long time since I've done this; I'm so sorry, Todd!\" as my drink spilled all down the front of me, she yanked the cup away so fast it went all over her as well. She set the cup down on the table, and we both burst out laughing. She apologized again. I said, \"It's really okay; you know it's not the first time it has happened.\" \"I'm going to change my shirt; you need to change your pajama top. That way, we can put them in the wash.\" She went to my bedroom to change as I went to the bathroom to take my shirt off and wipe it down with a towel.\nAs always, I need assistance with putting a shirt on. I opened the bathroom door to head towards my room, but I noticed the door was barely shut before I even made it 2 feet. I could see Jennifer’s naked back with just underwear on. I slowly and quietly went back into the bathroom. But I threw my towel and shirt in the hallway because I knew she was going to ask for it. I decided to act like I was using the toilet. But I really just sat there debating if I should tell her what I had just seen. I hear her call my name, “Todd, are you alright in there?” I yelled back, “yeah.” I heard her walk past my door. So, I slowly opened the door, and she wasn’t in the bedroom, so I slowly peeked around the corner and then went in. I could hear the noise downstairs. She must have been throwing in a load of laundry. I sat in the room waiting for her to come back up to help me with my shirt and deodorant. All I could think to myself was, oh my gosh, and I wonder what she has on.\nI heard her come back up the stairs and into the bedroom. As she came around the corner, she smiled at me and set the basket back down. She had on grey leggings with a silk button-up pajama top. I couldn’t help but notice she had it buttoned far down. She says, “Todd, what shirt do you want on as she puts the deodorant on me” I found myself distracted once again. As she had bent over, I got a clear shot down her shirt. I gave her a little push so she would realize and stand up. She looked at me with a confused face. I just waved my hand as if I was saying forget about it. She grabbed my shirt and put it on me. I then thanked her. We made our way out to the living room; I asked her, “what show would you like on?” I had a feeling she was going to say criminal minds. Sure enough, she says, “Todd, are you telling me you forgot what show is my favorite?” So, I grabbed the remote and tuned it to criminal minds. The T.V was kind of static; the words were going in and out. Jennifer says, “There must be some lines down, that’s okay though. I’ve seen this episode before” she smiled & I laughed.\nYou could hear the wind howling outside; Martha was running around because she was so scared. Jennifer says, \"Look outside! Oh my gosh!\" I turned around and hopped back into my wheelchair; that way, I could be at eye level with the window. \"Wow,\" I said. It was like a whiteout. It seemed to be progressively getting worse very quickly. You couldn't even make out where the street was, let alone even see my van in the driveway. I jumped up on the couch, and she sat next to me. She whispered, \"I have a present for you.\"\nI looked at her with a very surprised look. Trying to scramble through my brain about what the present could be. I said, \"really? What is it?\" Jennifer said to me, \"just wait a few hours until after dinner, and then I will give it to you.\" I sighed, and she laughed because she knew I was not particularly eager to wait. She then says, \"Speaking of eating dinner, want a snack?\" I'm starving!\" I said \"yeah, I'll have something small\" she walked into the kitchen and yelled back, \"do you want some pudding or oatmeal, Todd?\" I yelled back, \"oatmeal\". I heard her fumbling around in the kitchen. I then got up into my wheelchair and went into the kitchen.\nShe had made me some apple cinnamon oatmeal with a banana on the side. She made a peanut butter and jelly sandwich for herself with a banana as well. Jennifer says to me, \"Oh hey, perfect timing! Let's eat\" When I eat, I can only chew on the left side of my mouth. It's very hard for me to use the other side. I have to take my time when eating. Otherwise, it'll get stuck. I have to also eat in a certain order. This way, it goes down smoother for me. So, Jennifer starts feeding me, and we begin to chat again. She asks how I'm doing with staffing right now. I responded, \"I'm okay, just wish I had more people, someone like you again.\" She says, \"I wish I could come back here, maybe one day.\" I asked her about how her job was going; she's been a masseuse for around three years now. Jennifer says, \"it's going okay, just tough because my hands and arms have been in a lot of pain.\" I responded, \"oh no, I'm so sorry you really shouldn't do it anymore\" \"I know, I'm seeing a physical therapist for it now if it doesn't get better, I'm going to have to find a new career.\" I smirked at her because I always think about her coming back to work with me. She said, \"I know what you're thinking over there.\" We laughed and continued to eat the rest of our food.\nI went back into the living room and tuned into the news. I wanted to see what was going on everywhere else. The weather outside still looked the same, still terrible. Jennifer came in and said she was going to clean up the kitchen. I gave her a big smile and a nod. The news is having trouble giving updates because power is going out all over western New York. We can only assume the worst and hope for the best. A few minutes go by, and I hear Jennifer say, “Todd's kitchen is all set, and laundry is in the dryer now” I say, “thank you, Jennifer.” She comes into the living room and sits on the floor with me. “Whatcha, watching,” I say, “ the news, I’m trying to get some updates, but I guess there are power outages everywhere,” she said “ that’s okay, I’m really not worried about it as long as I’m here with you,” I said, “thank you, me too.” Plus, I knew I had a bunch of candles and flashlights we could use in the basement, along with plenty of food and water.\nWe could only stand watching the news for so long and worrying ourselves to death. But I didn’t know what else we could do. I looked at Jennifer and said, “I’m sorry I don’t have more for us to do here!” Jennifer said, “oh my goodness, Todd, stop. I  think I have an idea!” I looked at her like she was crazy, mainly because it’s a really good or horrible idea when she says that. So, I asked, “what’s your idea?” She says, “Well, since I know we’re going to be stuck here for a while anyway, I thought we could write something about you. Something about your life, your stories!” I’ve thought about doing this before, but I’ve never really asked anyone to help me with it. I couldn’t believe she was offering. So, I said, “are you sure you want to? You know it’s not going to be fast”. She said, “yes, I’m sure, I know that.” She ran and grabbed my laptop in my office; I was behind her, and I did print out my notes for my book. She said to me, “what are you doing?” I told her, “I have a few notes for my book.” She said, “wow, Todd. You are always thinking.” I had about 15 pages, it has forward and back writing on them. Then she asked me, “Am I in your book?” I said to her, “maybe.” Then I started to type things on my augmentation device. She told me, “I’ll look at your notes, and I’ll write things on here as you type them on word processors and correct some things.” She leaned up against the couch by me, and we started.\nWell, I will try to remember and use my notes every time that I can. But some of the stories I will have to have other people explain. A lot of the stories in my life hold great meanings to me. Some may be good and others bad. But what’s life without the ups and downs? When I was around the age of 8, my sister had told me I was adopted along with her and my brother being adopted as well.  \nOur parents were doing something because they were talking to an adoption agency; they were doing many papers like an application. They had to complete the home study process, attend agency-sponsored training and work with a caseworker to find an appropriate match. We had a lot of paperwork to do before we left. We were going camping on the Week of 4th of July in Maine, M.E.; we were planning to stay for a week because our dad had a week of vacation. The second day we were up there, they had gotten a call about you. Then I remembered mommy said to me, “we are leaving very early in the morning; I will put you and your brother in the car.” I remembered being carried to the car, and the sun had not even risen yet. Sometimes I was awake for a few minutes, and then I’d fall back asleep for a few hours. When I was awake, we were in the car for a long time, so I asked them, “where are we going, mommy and daddy?” They said we were going to Saratoga Springs in New York to see a new child. He was born on September 1, 1972, so he is only a little over nine months old, but we don’t have any information on him yet.\nI remember them telling us the night before to be good, please. Maybe your Dad takes you and your brother out for ice cream. We continued to drive; they held hands and talked, but I didn’t hear them, then I fell back to sleep. When I woke up, my brother and I were in a double stroller. They were talking to a guy, and I heard them saying it was a young boy who lived in a foster home.\nThey had told us he has cerebral palsy; at the time, I didn’t know anything about it. He had also told us you couldn’t feed him out of a bottle because he isn’t capable of sucking on it. You’ll have to use a Sippy cup. He is a cute baby, but he will need a lot of special stuff over his lifetime. He told us across the street, and there is a campground; we are paying for your campsite so you can stay there for two days. I would like you to care for him for 24 hours to see if you want to adopt him. Suppose you choose to, then I will put your papers in to be processed. I looked at your father, and we both smiled and said, “Okay, sounds good.”\nThe guy called the nurse so she could bring him in the room, the nurse walked in the room, and she was holding you in her arms. She said, \"Mr. and Mrs. Hutchinson, would you like to meet Todd?\" We said yes and then went over to the nurse. We both couldn't get over how cute he was. The nurse said do you want to hold him? \"I said, \"yes, I would love to\"! My brother (Chuck) started to cry, so your Dad took him out of the stroller. He picked him up, and asked, \"What is that smell? We all giggled, and Sara pointed at Chuck. Your Dad asked the guy, where could I change him? He pointed at the changing table across the room.\nWhen He was changing your brother, I had Todd in my arms, and he was laughing. I remember Sara asking your dad if she could come over to see you. He told her, you can, but please be careful around Todd; remember how you were with your brother? Be extra careful. She walked over to us and looked right at you. She then asked, \"Mommy is this going to be my new baby brother?\" I asked her, \"Would you like him to be your baby brother?\" she shouted, \"YES.\" Then your dad and brother came back over as the guy asked if we had any other questions we needed to be answered. We didn't seem to have any questions or concerns at the time. So, our campground was all set to go, and we would meet with him again tomorrow at 2 pm.\nWe left the office, hopped into the car, and drove our car with the trailer attached to it over to the campsite. I knew your father was exhausted because he drove all morning so we could meet you. Sara came up to me and told me she was hungry, so I said I would start dinner as soon as we got a little settled into the campsite. Your dad had said he would get everyone ice cream once they ate their dinner. I could tell they both had big smiles on their faces. We pulled up, and I began to make the food, and your dad was setting up the trailer. I tried to keep Sara and Chuck as busy as I could to spend quality time with Todd when your dad was done with our trailer. It was around 6:30 pm, and he said it was time for ice cream! So, we went on a walk along the trails, saw the snack shop, and went in there. We got ice cream, and a couple more treats to have. We got back, and your dad was holding Todd in his arms; I could tell he was exhausted. He had told me I was going to lay down with Todd to take a nap. I told him I was going to play with Sara and Chuck for a bit and gave him a kiss on the cheek. After a little bit of time, I had gotten pretty tired myself, we all headed inside, and I locked the doors. I snuck into the room quietly so I wouldn’t wake Todd and crawled into bed.\nAround 4:30 AM, Todd started moving around. I could barely sleep because I was nervous and happy at the same time. Your Mom rolled over and opened her eyes. She went to get up, but I told her to lie back down, and I had it covered. I picked up Todd, got his Sippy cup of milk and new diaper and clothes ready. I threw on my shoes and a blanket to wrap Todd in. I headed outside for some fresh air, and it was perfect timing because the sun was just starting to rise. It was very peaceful being able to sit there experiencing something new for Todd. Then the trailer door opened up, and I saw my beautiful wife coming out with 2 cups of coffee. She came over and said good morning to both of us. She asked me, how was he last night? I told her about how he likes to move a lot, but he was good. He slept almost the whole night; I just think he’s an early riser. We both laughed at each other. It was a lot to consider and think of, seeing as he is only nine months old.  We sat there and discussed what we should do. But what we are certain of was how happy we are that we met Todd. She asked me what I thought about adopting another child.\nWe adopted both Sara and Chuck without hesitation, but it was always the best decision. With everything we’ve gone through, I think we’ve done an excellent job raising them. The most significant factor we were worried about was the mental and physical disability he has. It was called cerebral palsy, which really hadn’t been talked about a lot throughout the U.S. Whatever we have been hit with, we have been able to handle it. We discussed some more, putting the whole idea of having a child with a disability aside and just thinking of him as an amazing child. We both feel like we can handle this, especially after spending the night with him we couldn’t leave him in the foster home. Whatever happens, I think we can give him a much better life than he would have here at the foster home. We agreed that we wanted to sign the papers. They had to do work with a caseworker to apply for a subsidy, if eligible. We were bringing your child home and completing at least three months of supervision, if necessary. We were finishing the adoption in court and contacting the agency for post-adoption services, as needed.\nAnyway, Just in time, Sara and Chuck came out of the camper, asking where Todd was. They came over and sat with us while your dad made some breakfast and brought it to the table for us. It was about noon when Sara and Chuck each took a bath, and we gave Todd a small bath in the sink. Your dad was making sure everything was cleaned up and packed. We headed over to meet the guy back at the office; Sara and Chuck went into the toy room. We followed the man back into his office and told him the great news that we wanted to adopt Todd. We were there for a very long time filling out paperwork and talking to many people. I felt terrible for Sara because I knew she didn’t like to be alone for such a long time. I kept looking at the door, ready to get my other kids and tell them the great news. Finally, it was time to get out of that stuffy room. We opened the door to get the kids, and they ran over to us. We said, “here is your new brother Todd”! We walked back to our campground. Everyone was happy and cheerful, but as I held Todd in my hands, I knew my life was going to change for the better. Tomorrow we’ll head home and start our new life with Todd. \nThat morning all those years ago is so like this morning. I revel in the memories for a few more minutes before I get out of my waterbed. My deliciously heated waterbed, did I mention? I got dressed. I go over to my computer. I've been keeping a few notes for myself because I want to write a book someday. When I finished writing my thoughts down on the computer,"
  },
  "doc-7b36ff69719684cf0e7514155b033ca9": {
    "content": "Before I start to tell about my life stories, I would like to first write how my parents met and how we lived in a beautiful home. I would like to go back to years ago, So, my father met my mother. He was 18 years old. My mother was only 13 years old; they were dating, and he knew she was the right girl for him. In 2 years, he knew that he wanted to marry her, and he started building the house for his family. He was 20 years old, and he wanted his house built next to his brother's house, and on the other side of our house, we got a different neighbor. His job was as a truck driver on weekdays, and then on weekends, he would go to the house and work on it. It took him a couple of years, but they got married, he was 23, and She was 18. Their house was done; it took them five years.\nThen they were looking to adopt a child, and they did; they adopted Sara when he was 28, and she was 23. They waited for three years to adopt another child, and they adopted Chuck. Then two years after that, they were bringing me home. I slept in my parents' bedroom. Anyway, the house was cool because my father built it with his two hands, and sometimes his brother helped him. Sara has the middle bedroom; it was a yellow room. Between my Parent's bedroom and my brother and I's bedroom, we shared a room together when I was a little older and knew how to crawl. We had bunk beds, I was sleeping in the bottom bunk, and Chuck was sleeping in the top bunk because bottom bunk because it was easy for me to crawl in and out of bed.\n We had a blue rug, so sometimes we imagined our rug was water and our bunk beds were a big ship and sometimes imagined we were fighting in the war. We played for hours; I love having a big brother, but sometimes he doesn't want to play with me, he was 7, and I was 4. Maybe he didn't completely understand what disability is, or I was different from him. I know that my brother wished that we could play sports together and bond like brothers. In our bedroom doorway in our bedroom, on my left side was my sister's room, then on my right side, it was the door to the basement. My brother thought that his bedroom closet was fantastic due to the slant that was the ceiling for the stairwell. Then looked up, there was the attic. They put Christmas stuff and things they aren't using for everyday things. That's the only place I didn't go into because it had stairs that came down from the ceiling and I could not climb.\nThen go past my sister's bedroom and basement, go forward a little bit. In front of me, it was the bathroom, and it had a blue tub. I called it a blue room. Then to my left side of me, it was our parents' bedroom. I turned to the right side of me, and it was a hallway. It has a small closet on the left side, and it has neat stuff in there for the house. To my right side, there was a nightlight. Keep going to get off the end of the hallway that leads out to a living room; there was TV, couches, and a coffee table. The front door was on the side of the living room. The little room is sitting by itself, and it has a closet for our coats. Looking forward to me, there is a half wall dividing the living room and kitchen. The half-wall was long and significant to me because I was on the floor crawling around. Then turn left, and there is a dining room with a wall between the kitchen and dining room. The dining room was used for our breakfast, lunch, and dinner, but my sister and brother had homework from their school. They had to sit there to do their homework; some nights were long nights for them. On the weekend, we played board games in the dining room. Between the dining and kitchen were walls. The stove is the oven built into the wall. When I was sitting in the dining room, behind me was a wall. It had a hole in the stove. I watched my mom cook, and she is the best cooker!  I love spaghetti and meat sauce, sometimes I wouldn't say I like the dinner they had, but every kid is like that. Then look to the left side of the half-wall; it is another door to go outside. The dining room and kitchen floor was a green carpet with a diamond-shaped pattern in black color when I was waiting for my mom to give me a drink. I played a game in my head with the carpet, or when I crawled on it, I kept my hands on the diamond shape on the rug. In the dining room, there is a patio door. That goes out to the backyard with a black gas grill on a pole that runs off the gas from the house. They had the pool in our backyard, they took it down because we went camping for a week, and our neighbor promised to clean it, but they didn't. Plus, Chuck climbed the rails, and he was dangling over, so they ended up taking it down. Our water comes from a well in the front yard, and the water goes through a purifier system set up in the basement. We had good clean water provided; the well sometimes went dry, but we learned to save water. When we used the bathroom, we couldn't flush every time. Although we went number two and the toilet would begin to smell, we would have to flush. My parents added the garage, second living room, and second bathroom to our house. Anyways, I was always a happy baby growing up. When I was growing up with my loving parents and my sister and brother, one of the things I remember the most was seeing many doctors, which I don't like.  I have gone to many different doctors, especially for my legs. I have never been able to walk, but that has never stopped me from doing what I want to do.  I would go camping a lot with my family, which was always something I loved doing. \nI started school when I was three years old; I do not remember that school very much.  Around four years old, I had started using a bliss board with different pictures to help me communicate and express my feelings. It was hard at first, but luckily, I caught on pretty quickly because it was easy to use. I learned bliss symbols faster than anyone else because teachers pushed me to use them. I thought that was how people started. I used it every day because it was helping me. One day I can remember this; it was watching my brother and me because my dad was taking my mom to go grocery shopping, they went into the town of East Aurora, and I was five years old this time. Then my sister started to get worried because it had been a few hours and the snow was falling fast, and she couldn't see the road. She was only ten years old, and our parents said to her, \"if you are scared or need anything, you can call our neighbor!\" Then the telephone rang, it was our parents! They wanted us to go to our neighborhood for a little while. She said OK, to our parents, and the neighbor knows that you and your brother and Todd are coming over. So, she got us dressed and walked over to our neighbors. My sister had to carry me. My brother was playing in the snow, and the neighbor saw us coming. I had to stay upstairs with the neighbor, and my sister and brother were playing with their kids downstairs, but they would come to check on me, but I didn't understand what happened because I stayed there days and my dad's brother lives on the other side of us. \nWe lived on the last road of Erie county, so our weather was a little different from Buffalo, N.Y. It was the storm of 1977. My parents, my sister, and my brother told me about the storm. In 1977 we had a lot of snow that year, and it was the record for the most snow in one season. Lake Erie was frozen over before the storm.  So the snow was sitting on the lake when we got winds averaging 45 with gusts of 75 mph. I remember that Dad was taking my neighbor and Mom grocery shopping in East Aurora, N.Y., but the neighbor's kids stayed home because they were a little older than my sister. The storm holds Buffalo's record for most snow in a short period, blizzard they called it. We stayed with our neighbor; we stayed at their house because Mom & Dad couldn't get home. They stayed at volunteer fireman Whiting's home.  Unsure why we did not go to Aunt Maureen & Uncle Don's?  The drifts in front of the house were as high as the telephone electricity wires & poles. Dad insisted we go shopping. Though we could beat it, Dad was helping those in need during the storm at the fire hall. \nMom was stranded at the Whiting's, staying warm. I do not know what you were doing.  The blizzard of '77 happened on a Friday. Channel 2 just reported the story comes from the weatherman, a young man whose parents wanted to go shopping for groceries at the last minute got stuck in the car on the I 90. All year I thought that it was them, but it wasn't them. \nMy mom said that our dad insisted we go shopping. He thought he could beat the storm but was unsuccessful. I was 5, my sister was ten, and my brother was 8.  Lost power at the end of the week. We played in the basement with my neighbor's friends.  My parents finally got home as they followed the plow home. We stayed with the neighbor for days. There were so many of us that we had slept on floors. You had to watch TV in the living room. That was the only television back then. I was not allowed to go downstairs with the other six kids because they were afraid I would slip or fall and how I would climb back up.   I sat on my rump in my house and could slide up backward one step at a time, but their steps were open, so truthfully it was scary to my sister, so it was better to be safe than sorry.   \nI remember my sister telling me we had to scoop up snow in pots to fill pans with snow to melt for water. Towards the end, we were refined through the snowstorm; we watched each other and remained safe because no one went anywhere. We couldn't get to a hospital if someone got hurt, but we made it, and it was scary a few times. When the snowstorm was over, we had walked back to our home, and it was hard because the snow was over the power lines. We had to be very careful because We didn't know where it was and we had to step over it plus we were walking next to the roof of our house. Everyone helped to shovel the path for us, but a few weeks later, the snow melted, and everything went back to normal.\nI will skip ahead a few years, so, when I turned eight years old, I would be changing schools again because my first and second school was closing the door, so I had a field trip to this new school called School 84.  I remember being very scared about starting at a new school, just like any kid is.  I was scared but knew I was going to be okay.\nAt this time, I have gotten very good with using the board, which helped ease my mind.  I would get very frustrated when new people could not understand what I was trying to say or express the point that I was trying to get across, aggravating me.  I told myself I would try to stay calm. These are all new people I have to get used to. \nThe day I first went there, it was their last day of school.  When I walked in, it was a big school with a lot of kids around.  I took a tour of the school with one of the teachers and met a lot of people.  I got to see their gym, and it was so big.  They were playing foot hockey at the time, so I stopped to watch them.  A boy around my age walked up to me.  He said Hi, I am John. What is your name?  I had a nametag on, so I pointed to it.  He saw it and said, Oh, you are Todd, glad to meet you. \nI smiled at him, and then he started talking to me. I learned that he loves hockey; I knew my brother loved hockey too. He talked about hockey, and I knew nothing about it, but I listened to him because it was fascinating. After all, he told me everything about hockey and was patient with me. Since it is their last day of school, they get a lot of freedom to do what they want. \nThey could play outside or play in the gym.  He asked me, \"Do you know how to play hockey?\" I said, \"no,\" but I went over and showed him that I would like to try. \nHe said Oh, you want to be a goalie. I said yes.  He said this to me, \"Okay, you and I can play!\" I want to see what you can do. \nSo, I got out of my wheelchair and crawled to the goalie net.  Instead of using a hard puck, we used softball. This way, it is easier for us to play without getting hurt.  So, he got the softball and hit it towards me, and I stopped it!  Then he went to get 25 balls to shoot my way, and I quit 23 of them. \nI looked around; I saw a lot of kids looking to play hockey with us.  So, then we made two teams.  John wanted me to play on his team.  I think it is because he saw how good I was.  I did not understand at first why he came up to me and started talking with me. \nBut I was thrilled he did because I wanted to play but did not know-how.  He made this possible for me, and I gained a friend.  We played a fast game because it was almost time to go home.\nWe played for about 40 minutes, and we won!  It was 4 to 1.  We got ready to head home; I thanked John for everything, hoping we could be friends. \nAfter that, it was summer vacation, and I was thrilled.  I had a very long ride home on the bus, and I was dreading it.  But I knew that everyone would be ready to go camping for the summer when I got home.  I told my older brother how I played hockey and played like the goalie when I got home. \nHe was very proud of me and said we would play more so I could get even better.  We were leaving for camp for the summer that night, and I had 90 minutes left of riding. My parents had a summer home in Chautauqua Lake; my mother, sister, brother, and I stayed down there all summer, and my father would come for weekends.  He had to work a lot.  But then he would save up for his vacation time off.  We had a boat there; I have always been a little scared of the boat, but I would still go on.  We went swimming in the lake every weekend when my dad came.  We knew a lot of people there, which made it even better.\nWe considered them our family.  I had a sandbox down there that I was in 80% of the time.  I could never go anywhere by myself, so some kids would come there to play with me instead. \nEvery night after dinner, we went on a walk together.  It was always very peaceful.  When we got back, mom or dad would start the campfire, and as long as we were good that day, we could stay up and sit around the fire.  We would cook the camp pie, which was one of my favorite snacks.  You would have two pieces of bread you put in the pie iron, then put the apple filling on one side of the bread.  Then you close the iron up and set it in the fire for about 5 to 7 minutes.  Summer always seems to go fast to me because I am always enjoying everything so much more. \nI love sitting outside, relaxing, and watching people.  Once I know my birthday is coming, I get sad because summer is almost done, and school will start again.  Summers at the camp house are something I have looked forward to every year, and I am so happy we have had that time together. Once school starts back up, I will have to wake up at 6 in the morning to get ready and wait for the bus.\nI had an easy routine in the mornings; I put my socks on the night before because it was easy to do. So, I can throw away my underwear, pants, and shirt in under 10 minutes. Then I went to use the bathroom; at 6:15 am, I crawled to the kitchen to eat cereal. Then my mom heard me in the bathroom then she got up to feed me. It would take me around 15 minutes, and sometimes I ate a bowl of cereal. It does make me hungrier. When I am done with my breakfast, brushing my teeth and hair, when I am done with everything, I would go downstairs, get to my wheelchair and then wait for the school bus.  It usually comes around 7 am every day.  I was always the first one on the bus in the morning and then the last one off at the end of the day. I had a long ride each day to school; the bus drivers were very friendly to me.  She would take different ways for me so I would not get super bored every day.  I had about a 50 to 70-minute ride, only one way to school.  Then I had to do it again at the end of the day.  Then the school time was 6 hours long.  Once I got home, I would do my homework behind the couch, eat dinner, then go to bed.\nMy weekend was a relaxing time because I did not have to get up and rush.  I would get up before 8 in the morning on my own and watch Television.\nThen I could go to the mall with my mom, and once I got home, I would play with my toys. A few times, I had company to play with me. I remembered the baby girl came over to play with me because my mom has a bowling friend. Mom's friend's daughter, we played with my toys when she was 4-year-old. Over time she grew up, and I didn't say anything because I couldn't talk and didn't know how to say it. Is it right to have some feelings for her over the years? Sometimes, I look back and say to myself, would it change my life if I said something?\nAnyway, it was time to go back to school on Monday morning.  Being on the bus for so long had some negatives and some positives.  I liked it because I would see things I had never seen before.  I made the school bus my hangout because there were different groups of kids.  I wanted to watch everyone, especially one group in particular.  I watched them because it was interesting to me.  They were a group of kids that were deaf, and they would use sign language to talk.\nI would always watch their conversations so I could understand sign language better.  But after a while, I could tell that they were mad at me because I kept watching them.\nOne day they gave me a hard time staring at them, so I signed, I am not dumb.  They looked at each other with puzzled faces, and they said to me, do you understand us?  I said yes.\nThey were in shock, and then they stopped giving me a hard time.  They knew it was hard for me to do signs with my hands because I shake a lot.  Then they started to let me watch them when they talked while asking me questions, and then I had to answer them back. \nI was grateful they let me into their group.  It made the bus ride faster because I was busy learning sign language.  Sometimes the bus would have to get more kids, which made the ride even longer.  But I did not mind anymore because I would instead meet new kids than go home and do homework.  So, I thought the school bus driver went to the high school to pick up a kid.  Oh, I was wrong because when the driver opened the bus door, an older girl walked in and walked by me.  I smiled at her because she was charming.  She sat a few chairs down from me, but I could still see her.\nShe had long brown hair with a dress on it, and I thought she was beautiful.  I signed the language to my friends, I said to them, wow. She is hot.\nThey all smiled and agreed with me. But she saw me do it and she said to me, thank you.  I looked at her with my mouth open.  I did not know she could see me doing that.  Then she said to me, and it is okay, you made my day!  I turned red on my face.  She told me, you are so cute!  I could not believe this just happened.  From then on, I learned that we got her every Tuesday and Thursday from the high school to take her home. So, I made sure that I was dressing nice because I liked her. She lived about 10 minutes away from my house.  Over time I got to know more about her; I learned that she loves horses, and she learned about me.  She was 16 years old, and I was only nine, but she understood me very well.\nWe became good friends.  We hung out at her house and mine, and I found out she has a horse. Maybe she told me that, but I didn't listen to her because I was too busy checking her out, I guess. I saw her horse, and it was beautiful, and I rode her horse, but I fell, and I hurt my foot, but I was okay. She has a little brother, plus she was babysitting that day; it was time for his nap, and she wants me to take one too. I was shocked and hurt by it, and I said no, and I was fine. Her brother didn't lay down; I told her, \"you owe me.\" I went to his bed and laid there when he fell to sleep. When he was sleeping, I got off his bed, then my parents came to contact me, but she was the first friend of mine to go to my parent's house.  We got to know each other, and I was thrilled to meet a new friend like her.  \nWe've been writing for a while now, and we wanted to stop so we could eat lunch. Jennifer got up and stretched her back out. Martha was sitting on the top of the couch, watching all the snow come down. Jennifer said, \"wow, I'm already hungry. Do you want lunch, Todd?\" I told her, \"yes, please! I need to go to the bathroom first.\" She said, \"I am first!\" I yelled, \"nope!\" We were wrestling around, trying to push our way to the bathroom. We were laughing so hard for some reason. Then she jumped on my back and pinned me down. She was sitting on top of me and was holding my hands down. She said, \"What are you going to do now, Mr.?\" I looked at her, and I started laughing more because I knew I could still move around. I just wanted her to think she was winning. I should probably let her win; why not. A beautiful girl is sitting on top of me. So, I \"tried\" to move around, but I couldn't. She said to me, \"do you give up?\" I said, \"nope\" She responded, \"that's fine, but I need to go to the bathroom now! You can hit the floor three times, that way, you give up, or I might have an accident and go to the bathroom on you!\" I quickly hit the floor three times; she jumped off of me and ran to the bathroom, saying, \"I won. I won!\" I said, \"HEY! Why is my shirt wet!\" She looked at me with a puzzled face; she said, \"It isn't wet! Nice try, Todd; I won.\"\nSo, while she was in the bathroom, I got in my wheelchair and went into the kitchen. I splashed some water on my shirt, went back to the living room, and quickly got back on the floor before she came out. She came out of the bathroom, and she said, \"What were you doing in the kitchen?\" I told her, \"I was drying my shirt off because of you!\" She said, \"Oh no, you were not; I heard the water running.\" I told her, \"Come here so you can feel my shirt then\" She walked over to me then I grabbed the bottom of her legs. I was trying to knock her down as soft as I could. I got her down, and I jumped on top of her so she couldn't move. She was wiggling around so much that a button from her pajama shirt popped right off. Now her pajama shirt is starting to open up even more. I looked at her to try and get her attention to tell her. She was still laughing when she said to me, \"Todd, don't worry about it! I don't work for you anymore, plus I wore this pajama shirt for you.\" But I didn't really hear what she said because I was too worried about fixing her pajama shirt. I started to say something when she stopped me; \"did you hear me?\" I said, \"huh?\" She told me, \"you are still sitting on me? What are you doing? Are you trying to undress me?\" I told her, \"NO! I'm not.\" She started laughing, and She couldn't stop. She said, \"Todd, Todd! I am playing with you.\" I looked away, and my face turned red in my face. Then she told me, \"Friends are for playing around and joking together. That's what I was doing with you!\"\nI said to her, \"You are right. Do you realize I haven't gone to the bathroom yet? So, is it the same rule, right?\" She laughed and said, \"yes, Todd, I don't want to give up, But I will hit the floor three times so that you don't pee on me!\" \"I would like to do this again.\" She smiled. I said, \"we will\" then I got off of her and went to the bathroom.  When I got out, she said, \"I am going to make lunch for us, and after lunch, I am going to shovel outside.\" I told her, \"OK, sounds good.\"\nWhile she was heating some pizza, I noticed I had some texts from boo. She texted me asking, \"How are you doing? How much snow is at your house?\" I responded with, \"Hi, I'm doing good. Jennifer is here with me, and we are eating lunch now. I think around a foot of snow. It's hard to tell because of the wind.\" She sent back, \"I'm glad she's with you; stay inside and safe. Love you\" Jennifer said lunch was ready to eat. I went into the kitchen, and She started to feed me.\nWe always got pizza together, so it was perfect that I had gotten some the day before. She liked her pizza dipped in ranch sauce, but I liked mine in blue cheese. Then Jennifer said to me, \"Oh no! I think that I broke a tooth off.\" I told her, \"Are you OK?\" she said, \"yes, Todd, it is a fill-in because I got half of my tooth in front and on the side. It isn't anything because it happened a lot.\" But I didn't understand why her tooth broke off because the pizza was soft. As we started eating again, I noticed her pajama shirt was still opening, and I didn't know what to do. I had already mentioned it to her, but she seemed not to be worried about it. So, for the time being, I didn't say anything and tried not to get distracted. She said she was ready to get back to writing, so she went and grabbed the computer and put it next to her at the table. I told her, \"don't get that gross ranch sauce on my computer Jennifer!\" she gave me a dirty look and a smack on the chest. We laughed, and then we got back to writing.\nThen, Jennifer asked me, why did they think you were hard of hearing? I feel like your hearing is fine.  I will tell you my story; they have everything there every new school year, so every year, I got a hearing test, eye test, and saw a doctor there.\nWhen school started, I had to go to the hearing test room area because they had a hearing test system. \nEvery time I went to get my hearing testing done, I was not too fond of it because I had to wear a thing around my head, and my mouth kept moving to hear my movement.  Plus, I had to listen to deep sounds that were both high and low. \nWhen they made a noise, it would stay in my head, and I thought I heard it.  I would tell them when I heard it, but I was wrong; they did not make the noise.\nSo, they thought I had a hearing problem because I could not read and did not hear my teacher.  They wanted me to wear hearing aids, but I was not particularly eager to wear them because they hurt my ears and gave me a headache.\nWhen I told them about it, they thought I did not want to wear them, and they were right.  I thought my hearing was the same, so I tried to turn it off.\nSomeday it worked because I wore it, and everyone was happy.  I still had pain, but no more headaches. On the weekend it was the best because I did not wear hearing aids and it was relaxing.   Sometimes on Saturdays, I would go to the mall with my mom.  She liked to go to the mall to find good deals, but I loved to go to the mall to watch people.  Then Jennifer turned her head around and said, Todd, people watching? Come on, and I need the honest Todd!  I said OK, so she deleted what I said about people watching. She put in boys watching instead.  Then I yelled at her, saying I was watching girls, not boys!  Jennifer replied, \"I am happy that you like girls and not boys because I was scared that you might.  Before she gave me a bite of pizza, I said to her, after we're done eating, I will put you in the snow for that. We both laughed.  She gave me a bite of my pizza and took a bite too.\nJennifer asked, where were we? Wait, wait, I know where. I was going to the mall with your mom for shopping and boys watching. She turned her head and smiled at me, and I said to her, you are so cute, but no, I wasn't going for boys watching! I went with my mom to the mall because I like to look at everything and girls watch.  My mom pushed my wheelchair around the mall as I sat and watched everything going on around me.  If we did not go to the mall, I would play with my toys.  I had my own space to play in; I would play for hours and hours all by myself.  If I did not feel like playing by myself, I would go downstairs and watch my dad play with his trains.  He has about 200 miniature trains; he played with them only on the weekends. When the weekend was over, I had to go back to school.  I had to wear my hearing aids again, and I was happy to get my headache back.\nSome days, I would forget my hearing aids at home because I felt they were not a part of me. When I remembered them, I got on the school bus, and I tried turning them down or off.  The problems started because the school had a swimming pool.\nA teacher would take my hearing aids, and one day a teacher asked me, why is it off? But I played dumb because I did not want them to know that I turned it off.  Well, a few weeks went by, and I heard the same question every week. \nThe following day, my teacher asked me to come to her to see my hearing aid and turn it on. \nI wasn't a happy person; by lunch, I took my hearing aids out and gave them to the person feeding me for lunch because I did not want to listen to 300 kids talking.  I ate enough food to feed three people, and they thought I would get sick, but I did not because I was a hungry person!  I had not eaten for 6 hours at lunchtime, so I ate my lunch like my dinner.  After lunch, I was happier.  When I was done eating, someone would put my hearing aids back in my ears before going back to class.  I had my hearing aids on, but I still didn't hear my teacher.  No one knew why.  I was looking at the teacher when they were teaching a class, but I was doing poorly in the class because I was daydreaming a lot and I was bored.  After weeks went by, they tried to do different things with me, but I was unhappy because my schedule wasn't the same.  They wanted me to do more Physical therapy, Occupational therapy, and Speech, but I thought it was a joke because I was not learning anything exciting.  When it was time to go to P.T. or O.T., I loved it and hated it because I knew them, but when they heard that I wore hearing aids, they gave me a hard time.  They would talk to me without their voices to make me feel hard of hearing.  When I was done with P.T., O.T., swimming, art class, workshop, cooking class, and my classroom, I went to Speech and waited because I had never been there before.\nThere were four rooms for the Speech teacher and side rooms for the hearing tests, so I waited for a door to open.\nI waited for a few minutes, and then a door opened, and I saw my new teacher.  She said Hi, Todd. I am Mrs. Grill, come to my room.  I did, and we worked on my picture board.  She knew I had a lot to say, but I needed more pictures, so we worked on it every time I saw her.  She took her time with me, and she knew my old teacher, Mrs. Saran, so we sometimes worked together, and she would always give me candy.\nThen one day, they wanted me to try something different, so I went into Mr. B's classroom, a harder classroom for reading.  When I was in the reading classroom, he gave me a book to read that he wanted everyone to read for 15 minutes.  He opened the book for me, and I tried reading it, but I could not read it, so I started to cry.  Mr. B saw me; he came over to me and sat next to me.  He asked me what was wrong? And I tried telling him that I could not read it. \nHe told me to take the book and said, I would like you to answer ten questions for me, and then he told me to go to room 120 next period.  I said OK, he let me leave a little early, so I went to room 120. When I was there, I saw a woman sitting at a table as I went into the big room.\nShe said, \"Hi, I am Mrs. J; I am going to help you with your schoolwork.  I heard that you have hearing aids\", Here we go again. I asked myself my dumb hearing aids. I asked myself, \"Is she going to do it as the therapist does it?\" no voices!   I said Hi to her, and I said yes, I do.  I loved it when others would read to me. When someone else read to me, I would listen to it and put myself in the story. I answered Mr. B's questions without any problems and went back to his classroom.  I saw that he was busy, but he saw me outside his room waiting.\nEveryone was looking at me and asked if I was OK. (because when the students are sitting outside their classroom. It meant that you were terrible in his classroom, but I wasn't, I was waiting for him to be done, but no one knows that so,) I said yes.  Then Mr. B came out of his classroom and said, Hi, Todd.  I said Hi back to him.  He saw that I had his book with his questions done.  He took it off my lap and said, \"Thanks, Todd.\" He asked me to come into his classroom, which was full of older kids, and I was a little scared, but I went with him.  \nI sat on the side because he was busy, and I had no idea why I was there.  He looked at my paper with his questions, checked my answers, and said, Stop reading, everyone. You may leave now.  I took my picture board, and I showed him the picture. I am sorry.  He asked, why are you sorry?  You do not have to be. I know you would have waited out there until I was done.  No worries, but I am going to tell you something. Today was a test.  I looked at him, and Mrs. J came in while we talked, but Mr. B continued, I know you can't read, and I am sorry I put you in my classroom without information; I wanted to see something.  These questions I gave you were last week's questions. I am looking at them right now, and your answers are the best I got.  You might need some help, but you have a high I.Q., and we have to find a way to get it out of you.\nJennifer said to me, \"You have to have a high IQ.\" I told her, \"I think not because the next story is my problem, and I feel like I am dumb and I can't read, talk, and I use the pictures board. Jennifer said to me, \"You aren't dumb, and I think that you are so smart and handsome.\" She said, stop that, and can we go back to writing because I want to know why you think that you are dumb. She gave me another bite of my pizza, and she did too.\nWe went to write, and they think that I have a high IQ because I understand everything, but When I meet people or go somewhere, my problem is when I meet new people, I can't remember their names. I saw a lot of people come in and go out of my life, but I can remember their faces without a problem, but I just wasn't good with their names. Sometimes I gave them a nickname, but I would know their name if I saw them a lot. I can take you 100 ways to go from my house to School 84, but if you ask me to tell you the name of roads to take, I wouldn't know, but I can show you with no problem, and I can read a map no problem.\nBefore the computer came out to my world, I had a book with pictures; it was sometimes a joke because I didn't use it when I was home or camping with my parents.  I went to many places, and I remember going to a house, and they were cooking the lobster and eating it, but my dad doesn't like eating it, but my mom loves it. So, I could call them lobster people because I didn't know what to call my Grandma, Grandpa, and Uncle. Over the years, I learned they were my grandparents and Uncle. They are very friendly and giving people. They moved away because my grandfather loves big boats, but my mom doesn't like to go on the boat. She did go on it anyway. My dad bought a boat to take over the summer. When we were camping in summer, they would come up for a week or two weeks to stay with us.\nI remembered one summer, my Grandmother liked to get up at 5 am. She likes to go to get coffees, doughnuts, and newspapers for our grandfather.  One morning she took our dog for a ride. Well, their car had a flat tire. She was 2 miles away from our campground, around 8 o'clock.  Later on, everyone heard a lady, and she had a dog with her yelling. Everyone was awake in the campground by her and helping her. Then my mom said, \"There is our dog!\" And she saw her mother was walking forward to our traitor, she was yelling about me walking 2 miles, and she had to tie up two shirts together so I could walk the dog. Our dog was so thirsty, and she didn't stop drinking the water; everyone was giving our dog water. \nThen my Dad, my Grandfather, and my Uncle went to get their car and fix a flat tire. My Grandmother was tired that morning, but she kept going through the day. A few hours went by, and my grandfather came back driving his car and yelling at our Grandmother.  But at the end of the day, we were sitting around a campfire, and we were laughing about it.  \nAnother time we went up to see them, I remembered this one because my dad drove the green truck. I woke up in the back of the truck, and we had a very long ride ahead for us. They left early in the morning because they were hoping that we would sleep halfway. We are going to Newport, Rhode Island. I remembered there was little light outside, then my mom turned around and told me to go back to sleep. I tried, but I couldn't, but I did lay down for her, but it was hard for me because it was different, exciting, and something new.  \nSo yes, I was excited. Then a few hours went by, and I did go back to sleep. It was a long ride, but I thought I was in a different world when we got there! I saw my grandmother, Grandfather, and Uncle again.  I saw where they lived. We also visited my grandfather's boat. Oh boy, it was huge; he took us for a ride on it. We went fishing too. We got a haddock, took it back home, cooked it, and ate it. It was so good. I love lobster, too; they still all ate lobster too. I saw them a few times out of the year, but sometimes I didn't see them for a few years."
  }
}